tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_PF_TMR.h
#define ENETC_PF_TMR_TMR_CAPR_IEEE_1722_MASK     (0x1U)
#define ENETC_PF_TMR_TMR_CAPR_IEEE_1722_SHIFT    (0U)
#define ENETC_PF_TMR_TMR_CAPR_IEEE_1722(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CAPR_IEEE_1722_SHIFT)) & ENETC_PF_TMR_TMR_CAPR_IEEE_1722_MASK)

#define ENETC_PF_TMR_TMR_CAPR_ECADJ_MASK         (0x2U)
#define ENETC_PF_TMR_TMR_CAPR_ECADJ_SHIFT        (1U)
#define ENETC_PF_TMR_TMR_CAPR_ECADJ(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CAPR_ECADJ_SHIFT)) & ENETC_PF_TMR_TMR_CAPR_ECADJ_MASK)

#define ENETC_PF_TMR_TMR_CAPR_IEEE_8021AS_REV_MASK (0x4U)
#define ENETC_PF_TMR_TMR_CAPR_IEEE_8021AS_REV_SHIFT (2U)
#define ENETC_PF_TMR_TMR_CAPR_IEEE_8021AS_REV(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CAPR_IEEE_8021AS_REV_SHIFT)) & ENETC_PF_TMR_TMR_CAPR_IEEE_8021AS_REV_MASK)

#define ENETC_PF_TMR_TMR_CAPR_NUM_MSIX_MASK      (0x10000U)
#define ENETC_PF_TMR_TMR_CAPR_NUM_MSIX_SHIFT     (16U)
#define ENETC_PF_TMR_TMR_CAPR_NUM_MSIX(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CAPR_NUM_MSIX_SHIFT)) & ENETC_PF_TMR_TMR_CAPR_NUM_MSIX_MASK)
/*! @} */

/*! @name TMR_FRT_L - Timer free running time low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_FRT_L_TMR_FRT_L_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_FRT_L_TMR_FRT_L_SHIFT   (0U)
#define ENETC_PF_TMR_TMR_FRT_L_TMR_FRT_L(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FRT_L_TMR_FRT_L_SHIFT)) & ENETC_PF_TMR_TMR_FRT_L_TMR_FRT_L_MASK)
/*! @} */

/*! @name TMR_FRT_H - Timer free running time high register */
/*! @{ */

#define ENETC_PF_TMR_TMR_FRT_H_TMR_FRT_H_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_FRT_H_TMR_FRT_H_SHIFT   (0U)
#define ENETC_PF_TMR_TMR_FRT_H_TMR_FRT_H(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_FRT_H_TMR_FRT_H_SHIFT)) & ENETC_PF_TMR_TMR_FRT_H_TMR_FRT_H_MASK)
/*! @} */

/*! @name TMR_SRT_L - Timer synchronous time low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_SRT_L_TMR_SRT_L_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_SRT_L_TMR_SRT_L_SHIFT   (0U)
#define ENETC_PF_TMR_TMR_SRT_L_TMR_SRT_L(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_SRT_L_TMR_SRT_L_SHIFT)) & ENETC_PF_TMR_TMR_SRT_L_TMR_SRT_L_MASK)
/*! @} */

/*! @name TMR_SRT_H - Timer synchronous time high register. */
/*! @{ */

#define ENETC_PF_TMR_TMR_SRT_H_TMR_SRT_H_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_SRT_H_TMR_SRT_H_SHIFT   (0U)
#define ENETC_PF_TMR_TMR_SRT_H_TMR_SRT_H(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_SRT_H_TMR_SRT_H_SHIFT)) & ENETC_PF_TMR_TMR_SRT_H_TMR_SRT_H_MASK)
/*! @} */

/*! @name TMR_DEF_CNT_L - Default ns timer counter low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_DEF_CNT_L_TMR_DEF_CNT_L_MASK (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_DEF_CNT_L_TMR_DEF_CNT_L_SHIFT (0U)
#define ENETC_PF_TMR_TMR_DEF_CNT_L_TMR_DEF_CNT_L(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_DEF_CNT_L_TMR_DEF_CNT_L_SHIFT)) & ENETC_PF_TMR_TMR_DEF_CNT_L_TMR_DEF_CNT_L_MASK)
/*! @} */

/*! @name TMR_DEF_CNT_H - Default ns timer counter high register */
/*! @{ */

#define ENETC_PF_TMR_TMR_DEF_CNT_H_TMR_DEF_CNT_H_MASK (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_DEF_CNT_H_TMR_DEF_CNT_H_SHIFT (0U)
#define ENETC_PF_TMR_TMR_DEF_CNT_H_TMR_DEF_CNT_H(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_DEF_CNT_H_TMR_DEF_CNT_H_SHIFT)) & ENETC_PF_TMR_TMR_DEF_CNT_H_TMR_DEF_CNT_H_MASK)
/*! @} */

/*! @name TMR_CTRL - Timer Control Register */
/*! @{ */

#define ENETC_PF_TMR_TMR_CTRL_CK_SEL_MASK        (0x3U)
#define ENETC_PF_TMR_TMR_CTRL_CK_SEL_SHIFT       (0U)
/*! CK_SEL - 1588 timer reference clock source select */
#define ENETC_PF_TMR_TMR_CTRL_CK_SEL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_CK_SEL_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_CK_SEL_MASK)

#define ENETC_PF_TMR_TMR_CTRL_TE_MASK            (0x4U)
#define ENETC_PF_TMR_TMR_CTRL_TE_SHIFT           (2U)
/*! TE - 1588 timer enable */
#define ENETC_PF_TMR_TMR_CTRL_TE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_TE_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_TE_MASK)

#define ENETC_PF_TMR_TMR_CTRL_CIPH_MASK          (0x40U)
#define ENETC_PF_TMR_TMR_CTRL_CIPH_SHIFT         (6U)
/*! CIPH - External oscillator input clock phase */
#define ENETC_PF_TMR_TMR_CTRL_CIPH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_CIPH_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_CIPH_MASK)

#define ENETC_PF_TMR_TMR_CTRL_COPH_MASK          (0x80U)
#define ENETC_PF_TMR_TMR_CTRL_COPH_SHIFT         (7U)
/*! COPH - Generated clock (TMR_GCLK) output phase. */
#define ENETC_PF_TMR_TMR_CTRL_COPH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_COPH_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_COPH_MASK)

#define ENETC_PF_TMR_TMR_CTRL_ETEP1_MASK         (0x100U)
#define ENETC_PF_TMR_TMR_CTRL_ETEP1_SHIFT        (8U)
/*! ETEP1 - External trigger 1 edge polarity */
#define ENETC_PF_TMR_TMR_CTRL_ETEP1(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_ETEP1_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_ETEP1_MASK)

#define ENETC_PF_TMR_TMR_CTRL_ETEP2_MASK         (0x200U)
#define ENETC_PF_TMR_TMR_CTRL_ETEP2_SHIFT        (9U)
/*! ETEP2 - External trigger 2 edge polarity */
#define ENETC_PF_TMR_TMR_CTRL_ETEP2(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_ETEP2_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_ETEP2_MASK)

#define ENETC_PF_TMR_TMR_CTRL_COMP_MODE_MASK     (0x8000U)
#define ENETC_PF_TMR_TMR_CTRL_COMP_MODE_SHIFT    (15U)
/*! COMP_MODE - Mode bit to allow atomic writes to TCLK_PERIOD and TMR_ADD */
#define ENETC_PF_TMR_TMR_CTRL_COMP_MODE(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_COMP_MODE_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_COMP_MODE_MASK)

#define ENETC_PF_TMR_TMR_CTRL_TCLK_PERIOD_MASK   (0x3FF0000U)
#define ENETC_PF_TMR_TMR_CTRL_TCLK_PERIOD_SHIFT  (16U)
/*! TCLK_PERIOD - 1588 timer reference clock period */
#define ENETC_PF_TMR_TMR_CTRL_TCLK_PERIOD(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_TCLK_PERIOD_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_TCLK_PERIOD_MASK)

#define ENETC_PF_TMR_TMR_CTRL_PP2L_MASK          (0x4000000U)
#define ENETC_PF_TMR_TMR_CTRL_PP2L_SHIFT         (26U)
/*! PP2L - Fiper2 pulse loop back mode enabled */
#define ENETC_PF_TMR_TMR_CTRL_PP2L(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_PP2L_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_PP2L_MASK)

#define ENETC_PF_TMR_TMR_CTRL_PP1L_MASK          (0x8000000U)
#define ENETC_PF_TMR_TMR_CTRL_PP1L_SHIFT         (27U)
/*! PP1L - Fiper1 pulse loop back mode enabled */
#define ENETC_PF_TMR_TMR_CTRL_PP1L(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_PP1L_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_PP1L_MASK)

