tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_PF_TMR.h
#define ENETC_PF_TMR_TMR_TEMASK_ETS1EN_MASK      (0x1000000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1EN_SHIFT     (24U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS1EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ETS2EN_MASK      (0x2000000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2EN_SHIFT     (25U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS2EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ETS1_OVEN_MASK   (0x10000000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1_OVEN_SHIFT  (28U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1_OVEN(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS1_OVEN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS1_OVEN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ETS2_OVEN_MASK   (0x20000000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2_OVEN_SHIFT  (29U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2_OVEN(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS2_OVEN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS2_OVEN_MASK)
/*! @} */

/*! @name TMR_STAT - Timer status register */
/*! @{ */

#define ENETC_PF_TMR_TMR_STAT_ETS1_VLD_MASK      (0x1000000U)
#define ENETC_PF_TMR_TMR_STAT_ETS1_VLD_SHIFT     (24U)
#define ENETC_PF_TMR_TMR_STAT_ETS1_VLD(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_STAT_ETS1_VLD_SHIFT)) & ENETC_PF_TMR_TMR_STAT_ETS1_VLD_MASK)

#define ENETC_PF_TMR_TMR_STAT_ETS2_VLD_MASK      (0x2000000U)
#define ENETC_PF_TMR_TMR_STAT_ETS2_VLD_SHIFT     (25U)
#define ENETC_PF_TMR_TMR_STAT_ETS2_VLD(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_STAT_ETS2_VLD_SHIFT)) & ENETC_PF_TMR_TMR_STAT_ETS2_VLD_MASK)

#define ENETC_PF_TMR_TMR_STAT_RCD_MASK           (0x80000000U)
#define ENETC_PF_TMR_TMR_STAT_RCD_SHIFT          (31U)
/*! RCD - Timer Reference Clock Detected
 *  0b0..Reference Clock has not been detected as active. Registers in timer clock domain are not allowed to be
 *       accessed; reads return 0, writes are ignored.
 *  0b1..Reference Clock has been detected as active. Registers in timer clock domain are allowed to be accessed.
 */
#define ENETC_PF_TMR_TMR_STAT_RCD(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_STAT_RCD_SHIFT)) & ENETC_PF_TMR_TMR_STAT_RCD_MASK)
/*! @} */

/*! @name TMR_CNT_L - Timer counter low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_CNT_L_TMR_CNT_L_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_CNT_L_TMR_CNT_L_SHIFT   (0U)
/*! TMR_CNT_L - Timer counter register. */
#define ENETC_PF_TMR_TMR_CNT_L_TMR_CNT_L(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CNT_L_TMR_CNT_L_SHIFT)) & ENETC_PF_TMR_TMR_CNT_L_TMR_CNT_L_MASK)
/*! @} */

/*! @name TMR_CNT_H - Timer counter high register */
/*! @{ */

#define ENETC_PF_TMR_TMR_CNT_H_TMR_CNT_H_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_CNT_H_TMR_CNT_H_SHIFT   (0U)
/*! TMR_CNT_H - Timer counter register. */
#define ENETC_PF_TMR_TMR_CNT_H_TMR_CNT_H(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CNT_H_TMR_CNT_H_SHIFT)) & ENETC_PF_TMR_TMR_CNT_H_TMR_CNT_H_MASK)
/*! @} */

/*! @name TMR_ADD - Timer addend register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ADD_ADDEND_MASK         (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ADD_ADDEND_SHIFT        (0U)
/*! ADDEND - Timer addend. */
#define ENETC_PF_TMR_TMR_ADD_ADDEND(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ADD_ADDEND_SHIFT)) & ENETC_PF_TMR_TMR_ADD_ADDEND_MASK)
/*! @} */

/*! @name TMR_ACC - Timer accumulator register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ACC_TMR_ACC_MASK        (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ACC_TMR_ACC_SHIFT       (0U)
/*! TMR_ACC - 32-bit timer accumulator register */
#define ENETC_PF_TMR_TMR_ACC_TMR_ACC(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ACC_TMR_ACC_SHIFT)) & ENETC_PF_TMR_TMR_ACC_TMR_ACC_MASK)
/*! @} */

/*! @name TMR_PRSC - Timer prescale register */
/*! @{ */

#define ENETC_PF_TMR_TMR_PRSC_PRSC_OCK_MASK      (0xFFFFU)
#define ENETC_PF_TMR_TMR_PRSC_PRSC_OCK_SHIFT     (0U)
/*! PRSC_OCK - Output clock division prescale factor. */
#define ENETC_PF_TMR_TMR_PRSC_PRSC_OCK(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_PRSC_PRSC_OCK_SHIFT)) & ENETC_PF_TMR_TMR_PRSC_PRSC_OCK_MASK)
/*! @} */

/*! @name TMR_ECTRL - Extended timer control register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ECTRL_ETFF_THR_MASK     (0xFU)
#define ENETC_PF_TMR_TMR_ECTRL_ETFF_THR_SHIFT    (0U)
/*! ETFF_THR - External trigger FIFO threshold. */
#define ENETC_PF_TMR_TMR_ECTRL_ETFF_THR(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ECTRL_ETFF_THR_SHIFT)) & ENETC_PF_TMR_TMR_ECTRL_ETFF_THR_MASK)
/*! @} */

/*! @name TMROFF_L - Timer offset low register */
/*! @{ */

#define ENETC_PF_TMR_TMROFF_L_TMROFF_L_MASK      (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMROFF_L_TMROFF_L_SHIFT     (0U)
/*! TMROFF_L - Offset value of the clock counter. */
#define ENETC_PF_TMR_TMROFF_L_TMROFF_L(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMROFF_L_TMROFF_L_SHIFT)) & ENETC_PF_TMR_TMROFF_L_TMROFF_L_MASK)
/*! @} */

/*! @name TMROFF_H - Timer offset high register */
/*! @{ */

#define ENETC_PF_TMR_TMROFF_H_TMROFF_H_MASK      (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMROFF_H_TMROFF_H_SHIFT     (0U)
/*! TMROFF_H - Offset value of the clock counter. */
#define ENETC_PF_TMR_TMROFF_H_TMROFF_H(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMROFF_H_TMROFF_H_SHIFT)) & ENETC_PF_TMR_TMROFF_H_TMROFF_H_MASK)
/*! @} */

/*! @name TMR_ALARM_L - Alarm 1 time comparator low register..Alarm 2 time comparator low register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ALARM_L_ALARM_L_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ALARM_L_ALARM_L_SHIFT   (0U)
/*! ALARM_L - Alarm time comparator register. */
#define ENETC_PF_TMR_TMR_ALARM_L_ALARM_L(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_L_ALARM_L_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_L_ALARM_L_MASK)
/*! @} */

/* The count of ENETC_PF_TMR_TMR_ALARM_L */
#define ENETC_PF_TMR_TMR_ALARM_L_COUNT           (2U)

/*! @name TMR_ALARM_H - Alarm 1 time comparator high register..Alarm 2 time comparator high register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ALARM_H_ALARM_H_MASK    (0xFFFFFFFFU)
#define ENETC_PF_TMR_TMR_ALARM_H_ALARM_H_SHIFT   (0U)
/*! ALARM_H - Alarm time comparator register. */
#define ENETC_PF_TMR_TMR_ALARM_H_ALARM_H(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ALARM_H_ALARM_H_SHIFT)) & ENETC_PF_TMR_TMR_ALARM_H_ALARM_H_MASK)
/*! @} */

